/**
 * 各种正则
 */

/** 手机号 */
export const mobile = /^0?(13[0-9]|15[0-9]|18[0-9]|14[0-9]|17[0-9])[0-9]{8}$/

/** 电子邮箱 */
export const email = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/

/** 密码【6-20位】 */
export const password = /^[@A-Za-z0-9!#$%^&*.~,]{6,20}$/

/** 正整数【不包含0】 */
export const integer = /^[1-9]\d*$/

/** 金钱 */
export const money = /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/

/** 纳税识别号 */
export const TINumber = /^((\d{6}[0-9A-Z]{9})|([0-9A-Za-z]{2}\d{6}[0-9A-Za-z]{10,12}))$/
